/* Task 1 is done !
Главаня разница между Листом и Массивом заключается в том что 
у массива при создания есть определенный размер.А лист дает
нам возможность создать пустой листь и добавлять в нем бесконечные
количество обьектов, цифр и так далле.И преимущество List в том
что у него есть готовые методы которые урошають нашу задачу.*/


/* Task 2 is done !
Наследования это один из важнейших принципов ООП.С помошью
наследсво один класс можеть унаследовать функционал другого класса.
Их называють Родителскими и Дочернимы классами где дочерный берет Например:
Метод,Поля своего родителя.Конструктор с дочерного класса
можно вызвать ключевым словом base.*/

/* Task 3 is done !
Полиморфизм явялется одним из принципов ООП.Его главная идея состоит в том
чтобы один и тот же метод работал по разному для разных обьектов.Существует два
способа использовать Полиморфизм первый это virtual methods а второе абстракные классы про 
которых мы поговорим в даллее.Одно из главных и различии Virtual Methods от абстрактных 
классов это то что тело метода должно быть всегда заполненым.Это и есть главная проблема 
Virtual Methods хотя и даже существуют ситуауии где мы также будем испозовать Visual Methods
Хотя по моему мнению Абсракт боллее удобнее.



/* Task 4 is done !
Абстракные класси помгают чтобы один метод работал для
каждого класса по разному.Чтобы обьявить его перед классом нужно
писать abstract.И главный класс становится если можно
сказать общым как Шаблон.С него нельзя создать обьект.
А можно обьекты созадват через дочерные классы испозуя override.*/


